rust/export/src/schema_ifc4_slots.revert-oracle-mutation.patch
--- a/rust/export/src/schema_ifc4_slots.rs
+++ b/rust/export/src/schema_ifc4_slots.rs
@@ -87,7 +87,12 @@
             if slot.trim() != "$" {
                 continue;
             }
-            let _ = fill;
+            if fill.is_empty() {
+                self.required_unfilled += 1;
+                continue;
+            }
+            *slot = fill.to_string();
+            changed = true;
         }
         changed.then(|| format!("{}{}{}", &line[..=open], values.join(","), &line[close..]))
     }
